DataProcessors/гф_ЗагрузкаПродажWildberries.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<DataProcessor>
		<Properties>
			<Name>гф_ЗагрузкаПродажWildberries</Name>
			<Comment>//#wortmann #2.1 Интеграция с маркетплейсами #Галфинд (Уфимцев) Перминов 2022/11/08</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКФайлу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/гф_ЗагрузкаПродажWildberries/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ВыполнитьНаСервере()

	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ВыполнитьЗагрузкуДанныхПродажВБНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗапросAPI(Команда)
	
	Период = Объект.Период;
	Организация = Объект.Организация;
	
	Если Не ЗначениеЗаполнено(Период.ДатаНачала) ИЛИ Не ЗначениеЗаполнено(Период.ДатаОкончания) Тогда
		Ответ = Неопределено;

		ПоказатьВопрос(Новый ОписаниеОповещения("ВыполнитьЗапросAPIЗавершение1", ЭтаФорма, Новый Структура("Период", Период)), "Не указан период. Установить период равный предыдущей неделе?", РежимДиалогаВопрос.ДаНет);
        Возврат;
	Иначе
		//Скорректируем введенный период 
		Период.ДатаНачала = НачалоНедели(Период.ДатаНачала);
		Период.ДатаОкончания = КонецНедели(Период.ДатаОкончания);
	КонецЕсли;
	
	ВыполнитьЗапросAPIПродолжитьВызов(); 
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗапросAPIЗавершение1(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Период = ДополнительныеПараметры.Период;
 
	Ответ = РезультатВопроса;
	//Если Ответ = КодВозвратаДиалога.Да Тогда
	//	Период.ДатаНачала = НачалоНедели(НачалоНедели(ТекущаяДата())-1);
	//	Период.ДатаОкончания = НачалоНедели(ТекущаяДата())-1;
	//Иначе
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		ОтказВыполнения = Истина;
	КонецЕсли;
	
	ВыполнитьЗапросAPIПродолжитьВызов();

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗапросAPIПродолжитьВызов()
	
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ВыполнитьЗапросAPIЗавершение", ЭтаФорма), "Не указана организация. Выполнить запрос по всем организациям, для которых есть настройки?", РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;
	
	ВыполнитьЗапросAPIФрагмент();

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗапросAPIЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = РезультатВопроса;
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		ОтказВыполнения = Истина;;
	КонецЕсли;
	
	ВыполнитьЗапросAPIФрагмент();

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗапросAPIФрагмент()
	
	Если НЕ ОтказВыполнения Тогда
		ВыполнитьНаСервере();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПолеПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Выберите файл";
	Диалог.ПолноеИмяФайла = ""; 
	Фильтр = "Лист Excel 2007+ (*.xlsx)|*.xlsx| Лист Excel 2003 (*.xls)|*.xls|"; 
	Диалог.Фильтр = Фильтр; 
	Диалог.МножественныйВыбор = Ложь;	
	Диалог.Показать(Новый ОписаниеОповещения("ВыборФайлаЗавершение", ЭтаФорма, Новый Структура("Диалог", Диалог)));
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборФайлаЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Диалог = ДополнительныеПараметры.Диалог; 
	
	Если (ВыбранныеФайлы <> Неопределено) Тогда				
		Объект.ПутьКФайлу = Диалог.ПолноеИмяФайла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьИзФайлНаСервере(АдресВХ)

	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ЭтоРегламентныйЗапуск = Ложь;
	ОбработкаОбъект.ВыполнитьЗагрузкуДанныхПродажИзФайла(АдресВХ);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайл(Команда)
	
	Период = Объект.Период;
	Организация = Объект.Организация;
	ПутьКФайлу = Объект.ПутьКФайлу;
	ТекстПредупреждения = "";
	
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		ТекстПредупреждения = ТекстПредупреждения + "Укажите организацию."+Символы.ПС;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Период.ДатаНачала) ИЛИ Не ЗначениеЗаполнено(Период.ДатаОкончания) Тогда
		ТекстПредупреждения = ТекстПредупреждения + "Укажите период."+Символы.ПС;
	Иначе
		Период.ДатаНачала = НачалоНедели(Период.ДатаНачала);
		Период.ДатаОкончания = КонецНедели(Период.ДатаОкончания);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ПутьКФайлу) Тогда
		ТекстПредупреждения = ТекстПредупреждения + "Укажите путь к файлу";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекстПредупреждения) Тогда
		ПоказатьПредупреждение(,ТекстПредупреждения,,"Ошибка ввода данных");
		Возврат;
	КонецЕсли;
	
	АдресВХ = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ПутьКФайлу));	
	
	ЗагрузитьИзФайлНаСервере(АдресВХ);
	
КонецПроцедуры
